#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-HoDVYHttPjmVfsud

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-gcp9dahm4c-irntllxe14-ANY]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-gcp9dahm4c-irntllxe14-ANY]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_lambda_function.auth: Refreshing state... [id=handler]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210630175300092700000001]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_lambda_function.github: Refreshing state... [id=lambda-github]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_iam_role_policy.lambda_invoke: Refreshing state... [id=iam_for_lambda:terraform-20210707172511482600000001]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=nn1sip]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.invoke_github will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "invoke_github"  {
      ~ id      = "3874920128" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:InvokeAsync",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:220881534007:function:lambda-github"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - success = true
                }
              - headers    = {
                  - time = "2021-07-08T20:05:38.381Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.actions will be created
  + resource "aws_api_gateway_integration" "actions" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.lambda will be updated in-place
  ~ resource "aws_api_gateway_integration" "lambda" {
        id                      = "agi-gcp9dahm4c-oly2td-ANY"
      ~ uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:220881534007:function:handler/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.lambda_root will be destroyed
  - resource "aws_api_gateway_integration" "lambda_root" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "irntllxe14" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "ANY" -> null
      - id                      = "agi-gcp9dahm4c-irntllxe14-ANY" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "irntllxe14" -> null
      - rest_api_id             = "gcp9dahm4c" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:220881534007:function:handler/invocations" -> null
    }

  # aws_api_gateway_method.actions will be created
  + resource "aws_api_gateway_method" "actions" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "PUT"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "gcp9dahm4c"
    }

  # aws_api_gateway_method.proxy_root will be destroyed
  - resource "aws_api_gateway_method" "proxy_root" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "ANY" -> null
      - id                   = "agm-gcp9dahm4c-irntllxe14-ANY" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "irntllxe14" -> null
      - rest_api_id          = "gcp9dahm4c" -> null
    }

  # aws_api_gateway_resource.actions will be created
  + resource "aws_api_gateway_resource" "actions" {
      + id          = (known after apply)
      + parent_id   = "irntllxe14"
      + path        = (known after apply)
      + path_part   = "actions"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_api_gateway_resource.app will be created
  + resource "aws_api_gateway_resource" "app" {
      + id          = (known after apply)
      + parent_id   = "irntllxe14"
      + path        = (known after apply)
      + path_part   = "app"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_api_gateway_resource.proxy will be updated in-place
  ~ resource "aws_api_gateway_resource" "proxy" {
        id          = "oly2td"
      ~ parent_id   = "irntllxe14" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy.lambda_invoke will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_invoke" {
        id     = "iam_for_lambda:terraform-20210707172511482600000001"
        name   = "terraform-20210707172511482600000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:InvokeAsync",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:220881534007:function:lambda-github"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.actions will be created
  + resource "aws_lambda_function" "actions" {
      + arn                            = (known after apply)
      + filename                       = "lambda-actions.zip"
      + function_name                  = "lambda-actions"
      + handler                        = "actions/src/main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::220881534007:role/iam_for_lambda"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "GOV7/9Yy26ftkI6vurowC19A8IUkbPTzaLyuGfoaTWg="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "managed-by" = "terraform"
        }
      + tags_all                       = {
          + "managed-by" = "terraform"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0dd30e1d7b3040e06",
            ]
          + subnet_ids         = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.app will be created
  + resource "aws_lambda_function" "app" {
      + arn                            = (known after apply)
      + filename                       = "app.zip"
      + function_name                  = "handler"
      + handler                        = "app/src/main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::220881534007:role/iam_for_lambda"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "LagWCp+LaStGC6k/YFSdb+RstAJtHgBh+AMv2xtG+Us="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "managed-by" = "terraform"
        }
      + tags_all                       = {
          + "managed-by" = "terraform"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0dd30e1d7b3040e06",
            ]
          + subnet_ids         = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.auth will be destroyed
  - resource "aws_lambda_function" "auth" {
      - arn                            = "arn:aws:lambda:ca-central-1:220881534007:function:handler" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - filename                       = "app.zip" -> null
      - function_name                  = "handler" -> null
      - handler                        = "app/src/main.handler" -> null
      - id                             = "handler" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:220881534007:function:handler/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-07-08T20:05:15.374+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:220881534007:function:handler:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::220881534007:role/iam_for_lambda" -> null
      - runtime                        = "nodejs12.x" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "k1x98rhOY6xjvi5J7INFsf9PccWLvXp1jjVFbilyJNE=" -> null
      - source_code_size               = 5439411 -> null
      - tags                           = {
          - "managed-by" = "terraform"
        } -> null
      - tags_all                       = {
          - "managed-by" = "terraform"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "AUD"                         = "sso-requests"
              - "CONFIGURATION_ENDPOINT"      = "https://dev.oidc.gov.bc.ca/auth/realms/onestopauth/.well-known/openid-configuration"
              - "DB_HOSTNAME"                 = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              - "DB_NAME"                     = "ExampleDB1"
              - "DB_PASSWORD"                 = (sensitive)
              - "DB_USERNAME"                 = (sensitive)
              - "KEYCLOAK_DEV_CLIENT_ID"      = "terraform-cli"
              - "KEYCLOAK_DEV_CLIENT_SECRET"  = "d39a06f5-88b6-4020-8681-b301e1668f37"
              - "KEYCLOAK_DEV_URL"            = "https://sso-dev-3d5c3f-dev.apps.silver.devops.gov.bc.ca"
              - "KEYCLOAK_PROD_CLIENT_ID"     = "terraform-cli"
              - "KEYCLOAK_PROD_CLIENT_SECRET" = "371366bd-b6b8-485d-a4fa-b89cb8942e63"
              - "KEYCLOAK_PROD_URL"           = "https://sso-prod-3d5c3f-prod.apps.silver.devops.gov.bc.ca"
              - "KEYCLOAK_TEST_CLIENT_ID"     = "terraform-cli"
              - "KEYCLOAK_TEST_CLIENT_SECRET" = "f14b5523-9cbe-4720-b030-6d54d01632aa"
              - "KEYCLOAK_TEST_URL"           = "https://sso-test-3d5c3f-test.apps.silver.devops.gov.bc.ca"
              - "NODE_ENV"                    = "production"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0dd30e1d7b3040e06",
            ] -> null
          - subnet_ids         = [
              - "subnet-048e25be105ae01d3",
              - "subnet-0896ff158c3ecdc53",
            ] -> null
          - vpc_id             = "vpc-018906cab60cf165b" -> null
        }
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
        id                             = "lambda-db"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2021-07-08T20:05:09.353+0000" -> (known after apply)
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "IftaXW5HuId40Ra1aXys5kxm/WuPOQRZnXWKWDQYCUY=" -> "hxw3PVq1MI4NFYs85yoWg8tzU1K4fPhceS3lUvkgz7s="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DB_HOSTNAME" = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com"
              - "DB_NAME"     = "ExampleDB1"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
              - "NODE_ENV"    = "production"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.github will be updated in-place
  ~ resource "aws_lambda_function" "github" {
        id                             = "lambda-github"
      ~ last_modified                  = "2021-07-08T20:05:02.953+0000" -> (known after apply)
      ~ source_code_hash               = "Tdm3RH45f7DTyecBC/KrdbwC3R9BiqcKLpLTzG11YMY=" -> "gp44nXriIh4tSCefCt0TNIBFEMwnGKneSzqVNmk9hW0="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.apigw will be destroyed
  - resource "aws_lambda_permission" "apigw" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "handler" -> null
      - id            = "AllowAPIGatewayInvoke" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/*/*" -> null
      - statement_id  = "AllowAPIGatewayInvoke" -> null
    }

  # aws_lambda_permission.apigw_actions will be created
  + resource "aws_lambda_permission" "apigw_actions" {
      + action        = "lambda:InvokeFunction"
      + function_name = "lambda-actions"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/*/*"
      + statement_id  = "AllowAPIGatewayInvoke"
    }

  # aws_lambda_permission.apigw_auth will be created
  + resource "aws_lambda_permission" "apigw_auth" {
      + action        = "lambda:InvokeFunction"
      + function_name = "handler"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/*/*"
      + statement_id  = "AllowAPIGatewayInvoke"
    }

  # module.db.aws_rds_cluster.this[0] must be replaced
-/+ resource "aws_rds_cluster" "this" {
      ~ arn                                 = "arn:aws:rds:ca-central-1:220881534007:cluster:aurora-db-postgres" -> (known after apply)
      ~ availability_zones                  = [
          - "ca-central-1a",
          - "ca-central-1b",
          - "ca-central-1d",
        ] -> (known after apply)
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-V5A5VXHGIGOKAG6MSQSXIVLQLU" -> (known after apply)
      ~ database_name                       = "ExampleDB1" -> "ExampleDB2" # forces replacement
      ~ db_cluster_parameter_group_name     = "default.aurora-postgresql10" -> (known after apply)
      - enabled_cloudwatch_logs_exports     = [] -> null
      ~ endpoint                            = "aurora-db-postgres.cluster-ch8pcggluehm.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version                      = "10.14" -> (known after apply)
      ~ hosted_zone_id                      = "Z1JG78A3UK1DU3" -> (known after apply)
      - iam_roles                           = [] -> null
      ~ id                                  = "aurora-db-postgres" -> (known after apply)
      ~ kms_key_id                          = "arn:aws:kms:ca-central-1:220881534007:key/e21a3726-7c61-43d0-b7ee-aa0c37f4b943" -> (known after apply)
      ~ reader_endpoint                     = "" -> (known after apply)
        tags                                = {
            "Terraform" = "true"
        }
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 5 to change, 5 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - success = true
        }
      - headers    = {
          - time = "2021-07-08T20:05:38.381Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @jlangy, Action: `pull_request`*